// src/stores/counter.js
import { defineStore } from 'pinia';

export const useCourses = defineStore('courses', {
  state: () => ({
    coursesDetails: [
      { id: "c", bgColor: "bg-blue-200", programming_lng: "C", featureCounts: [0, 0, 0] },
      { id: "cpp", bgColor: "bg-blue-400", programming_lng: "C++", featureCounts: [0, 0, 0] },
      { id: "python", bgColor: "bg-yellow-200", programming_lng: "Python", featureCounts: [0, 0, 0] },
      { id: "java", bgColor: "bg-red-300", programming_lng: "Java", featureCounts: [0, 0, 0] },
      { id: "html", bgColor: "bg-[orange]", programming_lng: "HTML", featureCounts: [0, 0, 0] },
      { id: "css", bgColor: "bg-blue-600", programming_lng: "CSS", featureCounts: [0, 0, 0] },
      { id: "bootstrap", bgColor: "bg-[purple]", programming_lng: "Bootstrap", featureCounts: [0, 0, 0] },
      { id: "vue", bgColor: "bg-blue-300", programming_lng: "Tailwind", featureCounts: [0, 0, 0] },
      { id: "javascript", bgColor: "bg-yellow-400", programming_lng: "JavaScript", featureCounts: [0, 0, 0] },
      { id: "react", bgColor: "bg-blue-400", programming_lng: "React", featureCounts: [0, 0, 0] },
      { id: "vue", bgColor: "bg-green-700", programming_lng: "Vue.js", featureCounts: [0, 0, 0] },
    ],
    features: [
      {
        text: "ជំពូក",
        icon: `<svg xmlns="http://www.w3.org/2000/svg" width="10px" height="10px" viewBox="0 0 24 24">
                <g fill="none" fill-rule="evenodd">
                  <path d="m12.593 23.258l-.011.002l-.071.035l-.02.004l-.014-.004l-.071-.035q-.016-.005-.024.005l-.004.01l-.017.428l.005.02l.01.013l.104.074l.015.004l.012-.004l.104-.074l.012-.016l.004-.017l-.017-.427q-.004-.016-.017-.018m.265-.113l-.013.002l-.185.093l-.01.01l-.003.011l.018.43l.005.012l.008.007l.201.093q.019.005.029-.008l.004-.014l-.034-.614q-.005-.018-.02-.022m-.715.002a.02.02 0 0 0-.027.006l-.006.014l-.034.614q.001.018.017.024l.015-.002l.201-.093l.01-.008l.004-.011l.017-.43l-.003-.012l-.01-.01z" />
                  <path fill="#000" d="M10 3q1 0 2 .76Q13 3 14 3h6a2 2 0 0 1 2 2v13a2 2 0 0 1-2 2h-7c0 .552-.45 1-1 1s-1-.45-1-1H4a2 2 0 0 1-2-2V5a2 2 0 0 1 2-2zm0 2H4v13h7V6c0-.55-.45-1-1-1m10 0h-6c-.55 0-1 .45-1 1v12h7z" />
                </g>
              </svg> `,
      },
      {
        text: "មេរៀន",
        icon: `<svg xmlns="http://www.w3.org/2000/svg" width="10px" height="10px" viewBox="0 0 24 24">
                <path fill="#000" d="M12 22C6.477 22 2 17.523 2 12S6.477 2 12 2s10 4.477 10 10s-4.477 10-10 10m0-2a8 8 0 1 0 0-16a8 8 0 0 0 0 16m1-8h4v2h-6V7h2z" />
              </svg>`,
      },
      {
        text: "ប្រលង",
        icon: `<svg xmlns="http://www.w3.org/2000/svg" width="10px" height="10px" viewBox="0 0 48 48">
                <g fill="#000">
                  <path d="M20 15a1 1 0 0 1 1-1h8a1 1 0 1 1 0 2h-8a1 1 0 0 1-1-1m1 3a1 1 0 1 0 0 2h8a1 1 0 1 0 0-2zm-1 10a1 1 0 0 1 1-1h8a1 1 0 1 1 0 2h-8a1 1 0 0 1-1-1m1 3a1 1 0 1 0 0 2h8a1 1 0 1 0 0-2z" />
                  <path fill-rule="evenodd" d="M10 27a1 1 0 0 1 1-1h5a1 1 0 0 1 1 1v5a1 1 0 0 1-1 1h-5a1 1 0 0 1-1-1zm2 1v3h3v-3z" clip-rule="evenodd" />
                  <path d="M17.707 15.707a1 1 0 0 0-1.414-1.414L13 17.586l-1.293-1.293a1 1 0 0 0-1.414 1.414L13 20.414z" />
                  <path fill-rule="evenodd" d="M10 6a4 4 0 0 0-4 4v28a4 4 0 0 0 4 4h20a4 4 0 0 0 4-4V10a4 4 0 0 0-4-4zm-2 4a2 2 0 0 1 2-2h20a2 2 0 0 1 2 2v28a2 2 0 0 1-2 2H10a2 2 0 0 1-2-2zm28 6a3 3 0 1 1 6 0v20.303l-3 4.5l-3-4.5zm3-1a1 1 0 0 0-1 1v2h2v-2a1 1 0 0 0-1-1m0 22.197l-1-1.5V20h2v15.697z" clip-rule="evenodd" />
                </g>
              </svg>`,
      },

    ],
    courseDetailsChapter: [
      {
        courseId: 'c',
        chapter_title: 'ជំពូក​ 01: សេចក្តីណែនាំអំពីភាសា C',
        lesson_1: {
          title: 'មេរៀនទី 01: តើ​ភាសា C គឺជាអ្វី?',
          time: '5:00',
          discription: 'ភាសាកម្មវិធី C គឺជាភាសាកម្មវិធីដែលមានសារៈសំខាន់ និងមានអនុភាព ញឹកញាប់ប្រើប្រាស់នៅក្នុងវិស័យគាំទ្របច្ចេកវិទ្យាព័ត៌មាន។ វាមានរចនាសម្ព័ន្ធសាមញ្ញ រួមមាន Header Files, Main Function, Statements និង Return Statement ដើម្បីបញ្ជាក់លទ្ធផលទៅប្រព័ន្ធ។ ទោះបីវាមានសេដ្ឋកិច្ចសាមញ្ញ ក៏វាមានអំណាចធ្វើឲ្យបង្កើតកម្មវិធីប្រភេទផ្សេងៗ។ មួយក្នុងចំណោមអត្ថប្រយោជន៍ដ៏សំខាន់គឺការគ្រប់គ្រង memory ដោយផ្ទាល់ ដែលជួយបង្កើនប្រសិទ្ធភាព និងល្បឿនរបស់កម្មវិធី។ភាសា C ត្រូវបានយកទៅប្រើយ៉ាងទូលំទូលាយសម្រាប់ការសរសេរកម្មវិធីប្រព័ន្ធ កម្មវិធីសម្រាប់ការគ្រប់គ្រងឧបករណ៍កុំព្យូទ័រ និងកម្មវិធីដែលមានប្រសិទ្ធភាពខ្ពស់។ C ត្រូវបានគេចាត់ទុកថាជាគ្រឹះដ៏សំខាន់សម្រាប់ការរៀនភាសាកម្មវិធីផ្សេងៗដូចជា C++, Java និង Python ដោយសារតែគន្លឹះនៃគំនិតកម្មវិធីដែលកើតមានពី C ។ ហេតុនេះការរៀនភាសា C គឺមានប្រយោជន៍ខ្ពស់សម្រាប់សិស្សនិស្សិត និងអ្នកចាប់ផ្តើមដែលចង់បង្កើនជំនាញបច្ចេកទេសរបស់ខ្លួន។ ការយល់ដឹងពីភាសា C ផ្តល់មូលដ្ឋានដ៏សមរម្យសម្រាប់ការយល់ពីភាសាកម្មវិធីកាន់តែជ្រាលជ្រៅ និងបច្ចេកទេសខ្ពស់ផ្សេងៗ ដែលអាចប្រើប្រាស់ក្នុងការអភិវឌ្ឍកម្មវិធីថ្មីៗ ។',
          vdo_url: 'https://www.youtube.com/embed/nrbBmoINqtk?si=OtjTAwnTiOw-k19x'



        },
        lesson_2: {
          title: 'មេរៀនទី 02: អំពីប្រភេទទិន្នន័យក្នុងភាសា C',
          time: '20:00',
          discription: 'Variables គឺជាអ្នកផ្ទុកតម្លៃ ដែលប្រើសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី។ វាអាចជាប្រេកង់ ឬទិន្នន័យបែបអក្សរ (characters) និងលេខ។ ប្រើប្រាស់ variables ត្រូវតែមានឈ្មោះ និងប្រភេទទិន្នន័យសមស្រប។ប្រភេទទិន្នន័យ (Data Types)int (អ៊ិន): សម្រាប់លេខគត់ (e.g., 10, -5)float (ហ្វ្លូត): សម្រាប់លេខទសភាគ (e.g., 3.14, -2.5)char (ឆារ): សម្រាប់តួអក្សរ (e.g., A, B)double (ដាប់ប៊ុល): សម្រាប់លេខទសភាគដែលមានភាពត្រឹមត្រូវខ្ពស់ជាង float',
          vdo_url: 'https://www.youtube.com/embed/nrbBmoINqtk?si=OtjTAwnTiOw-k19x'
        },
        quiz: {
          quiz_title_1: "Quiz 01",
          time_quiz_1: "2:00",
          questionsAnswers: [
            {
              title: "1.  អត្ថប្រយោជន៍សំខាន់មួយនៃការប្រើប្រាស់ភាសាកម្មវិធី C គឺអ្វី?",
              answers: [
                "A) វាមានរចនាសម្ព័ន្ធសាមញ្ញ មិនចាំបាច់ការគ្រប់គ្រង memory នោះទេ។",
                ' B) វាអាចគ្រប់គ្រង memory ដោយផ្ទាល់ ដែលជួយបង្កើនប្រសិទ្ធភាព និងល្បឿន។',
                ' C) វាអាចប្រើបានតែសម្រាប់ការបង្កើតកម្មវិធីតូចៗ។',
                ' D) វាមិនអាចបង្កើតកម្មវិធីប្រភេទផ្សេងៗបានទេ។'


              ],
              correct_ans: ' B) វាអាចគ្រប់គ្រង memory ដោយផ្ទាល់ ដែលជួយបង្កើនប្រសិទ្ធភាព និងល្បឿន។',
              score: 1
            },
            {
              title: "2.  ហេតុអ្វីបានជា​ការ​រៀនភាសា C ត្រូវបានគេពិចារណាថាជាសំខាន់សម្រាប់អ្នកចាប់ផ្តើម?",
              answers: [
                " A) C គឺជាភាសាកម្មវិធីតែមួយដែលប្រើប្រាស់ក្នុងបច្ចេកវិទ្យាខ្ពស់ៗ។",
                ' B) វាផ្តល់មូលដ្ឋានដ៏រឹងមាំសម្រាប់ការរៀនភាសាកម្មវិធីផ្សេងៗដូចជា C++, Java និង Python។',
                ' C) C គឺជាភាសាកម្មវិធីដែលមិនប្រើប្រាស់ទេក្នុងការអភិវឌ្ឍកម្មវិធីទំនើប។',
                ' D) C គឺជាភាសាកម្មវិធីដែលងាយស្រួលរៀនដោយគ្មានការយល់ដឹងពីមុន។',

              ],
              correct_ans: ' B) វាផ្តល់មូលដ្ឋានដ៏រឹងមាំសម្រាប់ការរៀនភាសាកម្មវិធីផ្សេងៗដូចជា C++, Java និង Python។',
              score: 1
            },
  
            {
              title: "3.ហេតុអ្វីបានជា​ការ​រៀនភាសា C ត្រូវបានគេពិចារណាថាជាសំខាន់សម្រាប់អ្នកចាប់ផ្តើម?",
              answers: [
                " A) C គឺជាភាសាកម្មវិធីតែមួយដែលប្រើប្រាស់ក្នុងបច្ចេកវិទ្យាខ្ពស់ៗ។",
                ' B) វាផ្តល់មូលដ្ឋានដ៏រឹងមាំសម្រាប់ការរៀនភាសាកម្មវិធីផ្សេងៗដូចជា C++, Java និង Python។',
                ' C) C គឺជាភាសាកម្មវិធីដែលមិនប្រើប្រាស់ទេក្នុងការអភិវឌ្ឍកម្មវិធីទំនើប។',
                ' D) C គឺជាភាសាកម្មវិធីដែលងាយស្រួលរៀនដោយគ្មានការយល់ដឹងពីមុន។',

              ],
              correct_ans: ' B) វាផ្តល់មូលដ្ឋានដ៏រឹងមាំសម្រាប់ការរៀនភាសាកម្មវិធីផ្សេងៗដូចជា C++, Java និង Python។',
              score: 1
            },
            {
              title: "4. តើអ្វីគឺជាការផ្តោតសំខាន់របស់ភាសាកម្មវិធី C ក្នុងការអភិវឌ្ឍកម្មវិធី?",
              answers: [
                "A) វាគឺសម្រាប់ការបង្កើតគេហទំព័រ។",
                'B) វាគឺសម្រាប់ការសរសេរកម្មវិធីប្រព័ន្ធ ការគ្រប់គ្រងឧបករណ៍ និងការបង្កើតកម្មវិធីដែលមានប្រសិទ្ធភាពខ្ពស់។',
                ' C) វាគឺសម្រាប់ការអភិវឌ្ឍកម្មវិធីទូរស័ព្ទចល័ត។',
                ' D) វាគឺត្រូវបានរចនាសម្រាប់ការរចនាកម្មវិធីដែលមានផ្ទាំងប្រើប្រាស់ទំនាក់ទំនង (GUI) តែមួយ។'
              ],
              correct_ans: 'B) វាគឺសម្រាប់ការសរសេរកម្មវិធីប្រព័ន្ធ ការគ្រប់គ្រងឧបករណ៍ និងការបង្កើតកម្មវិធីដែលមានប្រសិទ្ធភាពខ្ពស់។',
              score: 1
            }
          ],
          quiz_title_2: "Quiz 01",
          time_quiz_2: "5:00",
          questionsAnswers_quiz_2: [
            {
              title: "1.Variables គឺជាអ្វី?",
              answers: [
                "a. អ្នកផ្ទុកតម្លៃសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី",
                "b. កូដប្រើសម្រាប់ប្រតិបត្តិការ",
                "c. ប្រភេទទិន្នន័យមិនប្រើប្រាស់",
                "d. អ្នកសរសេរកម្មវិធី",
              ],
              correct_ans: "Correct : a. អ្នកផ្ទុកតម្លៃសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី",
              score: 1
            },
            {
              title: "2.ប្រភេទទិន្នន័យ int ត្រូវបានប្រើសម្រាប់អ្វី?",
              answers: [
                "a. សម្រាប់លេខគត់",
                "b. សម្រាប់លេខទសភាគ",
                "c. សម្រាប់តួអក្សរ",
                "d. សម្រាប់លេខដែលមានភាពត្រឹមត្រូវខ្ពស់",
              ],
              correct_ans: "Correct : a. សម្រាប់លេខគត់",
              score: 1
            },
            {
              title: "3.ប្រភេទទិន្នន័យណាដែលប្រើសម្រាប់តួអក្សរ?",
              answers: [
                "a. char",
                "b. int",
                "c. float",
                "d. double",
              ],
              correct_ans: "Correct : a. char",
              score: 1
            },
            {
              title: "4.តើប្រភេទទិន្នន័យណាដែលមានភាពត្រឹមត្រូវខ្ពស់ជាង float?",
              answers: [
                "a. char",
                "b. int",
                "c. float",
                "d. double",
              ],
              correct_ans: "Correct : d. double",
              score: 1
            }

          ],
   

        }
      }, 
      {
        courseId: 'cpp',
        chapter_title: 'ការណែនាំអំពីភាសាកម្មវិធី C++',
        lesson_1: {
          title: 'មេរៀនទី01: លក្ខណៈពិសេស និងការប្រើប្រាស់ភាសា C++',
          time: '10:00',
          discription: 'C++ គឺជាភាសាកម្មវិធីដែលមានលក្ខណៈប្រើប្រាស់បានច្រើនជាន់ និងត្រូវបានបង្កើតឡើងដោយបង្កើនលក្ខណៈសម្បត្តិថ្មីៗចូលទៅក្នុងភាសា C។ វាប្រើសម្រាប់អភិវឌ្ឍកម្មវិធីដែលមានប្រសិទ្ធភាពខ្ពស់ ដូចជា កម្មវិធីប្រព័ន្ធ (system software), កម្មវិធីប្រើប្រាស់ (application software), កម្មវិធីឧបករណ៍ (tool software) និងហ្គេម។C++ ត្រូវបានបង្កើតឡើងដោយ Bjarne Stroustrup នៅឆ្នាំ 1980 ហើយវាមានលក្ខណៈសំខាន់ៗដូចជា៖ការគាំទ្រគោលការណ៍ Object-Oriented Programming (OOP): វាអាចប្រើប្រព័ន្ធ objects ដើម្បីរៀបចំកូដឲ្យមានលំដាប់លំដោយ។ប្រសិទ្ធភាពខ្ពស់: វាមានល្បឿនលឿនក្នុងការដំណើរការ។ភាពអាចប្តូរបាន (Flexibility): វាអាចប្រើសម្រាប់ការអភិវឌ្ឍន៍ប្រព័ន្ធគ្រប់ប្រភេទ។C++ ក៏ត្រូវបានប្រើប្រាស់យ៉ាងទូលំទូលាយក្នុងវិស័យផ្សេងៗ ដូចជា៖ការបង្កើតប្រព័ន្ធប្រតិបត្តិការការអភិវឌ្ឍកម្មវិធីតង់ស៊ីធ្វើ (real-time systems)ការបង្កើតហ្គេម និងកម្មវិធីបច្ចេកវិទ្យាត្រូវការភាពច្បាស់លាស់ខ្ពស់។',
          vdo_url: 'https://www.youtube.com/embed/S3nx34WFXjI?si=a6sIPzuLsxwVpsP2',
        },
        lesson_2: {
          title: 'មេរៀនទី02: អំពីប្រភេទទិន្នន័យក្នុងភាសា C++',
          time: '10:00',
          discription: 'អថេរ (Variable) គឺជាឈ្មោះឬឋានបំណងដែលប្រើដើម្បីរក្សាតម្លៃឬទិន្នន័យនៅក្នុងកម្មវិធី។ វាអាចមានប្រភេទផ្សេងៗតាមប្រភេទទិន្នន័យ ដែលត្រូវបានប្រើសម្រាប់គណនា ឬការប្រតិបត្តិផ្សេងៗនៅក្នុងកម្មវិធី។ នៅក្នុង C++ អថេរត្រូវបានប្រកាសជាមុន ដោយប្រើកូនិស្អិតនៃប្រភេទទិន្នន័យដែលអ្នកចង់ប្រើ។លក្ខណៈសំខាន់ៗនៃអថេរ:ប្រភេទទិន្នន័យ (Data Type): អថេរត្រូវបានកំណត់ជាមួយប្រភេទទិន្នន័យដូចជា int, float, char, bool ជាដើម។ឈ្មោះអថេរ (Variable Name): ត្រូវតែមានឈ្មោះតែមួយដែលអាចកំណត់ដោយអ្នកប្រើ។តម្លៃ (Value): អថេរអាចមានតម្លៃផ្តាច់ឬតម្លៃដែលផ្លាស់ប្តូរបានក្នុងអំឡុងការប្រតិបត្តិ។',
          vdo_url: 'https://www.youtube.com/embed/nrbBmoINqtk?si=OtjTAwnTiOw-k19x',
        },
        quiz: {
          quiz_title_1: "quiz 01",
          time_quiz_1: "5:00",
          questionsAnswers: [
              {
                "title": "តើភាសាកម្មវិធី C++ ត្រូវបានបង្កើតឡើងដោយអ្នកណា និងនៅឆ្នាំណា?",
                "answers": [
                  "a. Dennis Ritchie, 1972",
                  "b. Bjarne Stroustrup, 1980",
                  "c. James Gosling, 1995",
                  "d. Guido van Rossum, 1991"
                ],
                "correct_ans": "b. Bjarne Stroustrup, 1980",
                "score": 1
              },
              {
                "title": "តើភាសា C++ មានការគាំទ្រគោលការណ៍អ្វីដែលសំខាន់ក្នុងការរៀបចំកូដ?",
                "answers": [
                  "a. Procedural Programming",
                  "b. Object-Oriented Programming",
                  "c. Functional Programming",
                  "d. Declarative Programming"
                ],
                "correct_ans": "b. Object-Oriented Programming",
                "score": 1
              },
              {
                "title": "តើលក្ខណៈសម្បត្តិដ៏សំខាន់បីប្រភេទនៃភាសា C++ មានអ្វីខ្លះ?",
                "answers": [
                  "a. មានបណ្ណាល័យធំ, ភាពងាយស្រួលក្នុងការរៀន, រចនាបថសាមញ្ញ",
                  "b. ការគាំទ្រគោលការណ៍ OOP, ប្រសិទ្ធភាពខ្ពស់, ភាពអាចប្តូរបាន",
                  "c. អាចសរសេរកូដខ្លី, ស្របច្បាស់ល្អ, មិនអាចប្តូរបាន",
                  "d. គាំទ្រសៀគ្វីប្រតិបត្តិការ, មានភាពធន់, ត្រូវបានប្រើសម្រាប់ហ្គេម"
                ],
                "correct_ans": "b. ការគាំទ្រគោលការណ៍ OOP, ប្រសិទ្ធភាពខ្ពស់, ភាពអាចប្តូរបាន",
                "score": 1
              },
              {
                "title": "តើភាសា C++ ត្រូវបានប្រើប្រាស់ក្នុងវិស័យណាខ្លះ?",
                "answers": [
                  "a. ការបង្កើតកម្មវិធីបច្ចេកទេស, ការបង្កើតបណ្ណាល័យចែករំលែក, ការសរសេរកូដរបៀបងាយស្រួល",
                  "b. ការបង្កើតប្រព័ន្ធប្រតិបត្តិការ, ការអភិវឌ្ឍ real-time systems, ការបង្កើតហ្គេម",
                  "c. ការបង្កើតកម្មវិធីស្រាវជ្រាវ, ការចងក្រងអត្ថបទ, ការបង្កើត AI",
                  "d. ការប្រើសម្រាប់ការរៀនសូត្រ, ការបង្កើតទិន្នន័យ, ការប្រើសម្រាប់តេស្ត"
                ],
                "correct_ans": "b. ការបង្កើតប្រព័ន្ធប្រតិបត្តិការ, ការអភិវឌ្ឍ real-time systems, ការបង្កើតហ្គេម",
                "score": 1
              },
              {
                "title": "គោលបំណងនៃ variable ក្នុងភាសា C++ គឺអ្វី?",
                "answers": [
                  "a. អ្នកផ្ទុកតម្លៃសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី",
                  "b. កូដប្រើសម្រាប់ប្រតិបត្តិការ",
                  "c. ប្រភេទទិន្នន័យមិនប្រើប្រាស់",
                  "d. អ្នកសរសេរកម្មវិធី"
                ],
                "correct_ans": "a. អ្នកផ្ទុកតម្លៃសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី",
                "score": 1
              },
              {
                "title": "តើប្រភេទទិន្នន័យ int ត្រូវបានប្រើសម្រាប់អ្វី?",
                "answers": [
                  "a. សម្រាប់លេខគត់",
                  "b. សម្រាប់លេខទសភាគ",
                  "c. សម្រាប់តួអក្សរ",
                  "d. សម្រាប់លេខដែលមានភាពត្រឹមត្រូវខ្ពស់"
                ],
                "correct_ans": "a. សម្រាប់លេខគត់",
                "score": 1
              },
              {
                "title": "ប្រភេទទិន្នន័យណាដែលគួរប្រើសម្រាប់ផ្ទុកលេខទសភាគក្នុងភាសា C++?",
                "answers": [
                  "a. int",
                  "b. float",
                  "c. double",
                  "d. char"
                ],
                "correct_ans": "b. float",
                "score": 1
              },
              {
                "title": "ក្នុងចំណោមជម្រើសខាងក្រោមនេះ អ្វីខ្លះដែលគឺជាប្រភេទ char នៅក្នុងភាសា C++?",
                "answers": [
                  "a. 3.14",
                  "b. 'A'",
                  "c. 123",
                  "d. 0.001"
                ],
                "correct_ans": "b. 'A'",
                "score": 1
              }
            ],
            quiz_title_2: "Quiz 01",
            time_quiz_2: "2:00",
            questionsAnswers_quiz_2: [
              {
                title: "1.Variables គឺជាអ្វី?",
                answers: [
                  "a. អ្នកផ្ទុកតម្លៃសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី",
                  "b. កូដប្រើសម្រាប់ប្រតិបត្តិការ",
                  "c. ប្រភេទទិន្នន័យមិនប្រើប្រាស់",
                  "d. អ្នកសរសេរកម្មវិធី",
                ],
                correct_ans: "Correct : a. អ្នកផ្ទុកតម្លៃសម្រាប់រក្សាទិន្នន័យក្នុងកម្មវិធី",
                score: 1
              },
              {
                title: "2.ប្រភេទទិន្នន័យ int ត្រូវបានប្រើសម្រាប់អ្វី?",
                answers: [
                  "a. សម្រាប់លេខគត់",
                  "b. សម្រាប់លេខទសភាគ",
                  "c. សម្រាប់តួអក្សរ",
                  "d. សម្រាប់លេខដែលមានភាពត្រឹមត្រូវខ្ពស់",
                ],
                correct_ans: "Correct : a. សម្រាប់លេខគត់",
                score: 1
              },
              {
                title: "3.ប្រភេទទិន្នន័យណាដែលប្រើសម្រាប់តួអក្សរ?",
                answers: [
                  "a. char",
                  "b. int",
                  "c. float",
                  "d. double",
                ],
                correct_ans: "Correct : a. char",
                score: 1
              },
              {
                title: "4.តើប្រភេទទិន្នន័យណាដែលមានភាពត្រឹមត្រូវខ្ពស់ជាង float?",
                answers: [
                  "a. char",
                  "b. int",
                  "c. float",
                  "d. double",
                ],
                correct_ans: "Correct : d. double",
                score: 1
              }
  
            ],
           

          }
        },
        
        
      
       {
        courseId: "Python",
        chapter_title: "ជំពូក 01: សេចក្តីណែនាំអំពីភាសា python",
        lesson_1: {
          title: "មេរៀនទី 01: ការនែនាំអំពីភាសាpython?",
          time: "2:00",
          discription: "Python គឺជាភាសាសរសេរកម្មវិធីដ៏ពេញនិយមមួយ។ វាត្រូវបានបង្កើតឡើងដោយ Guido van Rossum ហើយបានចេញផ្សាយនៅឆ្នាំ 1991 ។ ។",
          vdo_url: "https://youtu.be/xkZMUX_oQX4?si=wInaQdUFxr1oMvMu"
        },
        lesson_2: {
        title: "មេរៀនទី 02: Python - Syntax?",
        time: "2:00",
        discription: "Syntax ភាសា Python គឺជាសំណុំនៃច្បាប់ដែលកំណត់របៀបសរសេរ និងបកប្រែភាសា។ វាត្រូវបានរចនាឡើងឱ្យមានភាពច្បាស់លាស់ ងាយស្រួលអាន និងងាយស្រួលរៀន។ ខាងក្រោមនេះគឺជាចំណុចសំខាន់ៗមួយចំនួន៖ការវិលចូល (Indentation) ភាពប្រែប្រួលនៃអក្សរធំ-អក្សរតូច ពាក្យគន្លឹះ (Keywords) ប្រភេទទិន្នន័យអថេរ",
        vdo_url: "https://youtu.be/4WVZBtqqVM4?si=U7k6D-qsKGm_Gv4T"
        },
        quiz: [
          {
            quiz_title: "Quiz 01",
            time_quiz_1: "2:00",
            questionsAnswers: [
              {
                title: "1. តើpythonជាអ្វី?",
                answers: [
                  "A) ភាសាសរសេរកម្មវិធីដែលប្រើសម្រាប់បង្កើតហ្គេមកុំព្យូទ័រជាចម្បង",
                  "B) ភាសាសរសេរកម្មវិធីសាមញ្ញ និងងាយស្រួលរៀន ដែលប្រើប្រាស់បានទូលំទូលាយក្នុងវិស័យផ្សេងៗ",
                  "C) ភាសាសរសេរកម្មវិធីដែលប្រើសម្រាប់បង្កើតកម្មវិធីទូរស័ព្ទដៃតែប៉ុណ្ណោះ",
                  "D) ភាសាសរសេរកម្មវិធីចាស់ ដែលមិនត្រូវបានប្រើប្រាស់ច្រើនទៀតហើយ"
                ],
                correct_ans: "B) ភាសាសរសេរកម្មវិធីសាមញ្ញ និងងាយស្រួលរៀន ដែលប្រើប្រាស់បានទូលំទូលាយក្នុងវិស័យផ្សេងៗ",
                score: 1
              },
              {
                title: "2. តើpython អាចធ្វើអ្វីបានខ្លះ?",
                answers: [
                  "A) អភិវឌ្ឍន៍websites វិភាគទិន្នន័យ និងបង្កើតប្រព័ន្ធបញ្ញាសិប្បនិមិត្",
                  "B) ប្រើប្រាស់បានតែសម្រាប់គណនាគណិតវិទ្យាប៉ុណ្ណោះ",
                  "C) បង្កើតហ្គេមកុំព្យូទ័របានតែមួយប្រភេទ",
                  "D) ប្រើប្រាស់សម្រាប់បង្កើតឯកសារ Word និង Excel តែប៉ុណ្ណោះ"
                ],
                correct_ans: "A) អភិវឌ្ឍន៍websites វិភាគទិន្នន័យ និងបង្កើតប្រព័ន្ធបញ្ញាសិប្បនិមិត្ត",
                score: 1
              },
              {
                title: "3. ហេតុអ្វីបានជា​ការ​រៀនភាសា pythonត្រូវបានគេពិចារណាថាជាសំខាន់សម្រាប់អ្នកចាប់ផ្តើម?",
                answers: [
                  "A) ងាយស្រួលរៀន និងអាន ធ្វើឱ្យវាសមស្របសម្រាប់អ្នកចាប់ផ្តើមដំបូង",
                  "B) មានសហគមន៍អ្នកប្រើប្រាស់ធំ និងមានធនធានការរៀនរបស់ច្រើន",
                  "C) អាចប្រើប្រាស់បានទូលំទូលាយក្នុងវិស័យផ្សេងៗ ដូចជា វិទ្យាសាស្ត្រទិន្នន័យ បញ្ញាសិប្បនិមិត្ត និងការអភិវឌ្ឍន៍វេបសាយ",
                  "D) A, B, C"
                ],
                correct_ans: "D) A, B, C",
                score: 1
              }
            ]
          },
          {
            quiz_title: "Quiz 02",
            time_quiz_2: "2:00",
            questionsAnswers: [
              {
                title: "1. របៀបRun Python ក្នុងកុំព្យូទ័រ?",
                answers: [
                  "A) សរសេរកូដ Python នៅក្នុងកម្មវិធីនិពន្ធកូដ ដូចជា VS Code, Sublime Text ហើយប្រើប្រាស់ថាមពលបញ្ជា Terminal ដើម្បីប្រតិបត្តិការ",
                  "B) ប្រើប្រាស់កម្មវិធីចាប់ផ្ដើមកម្មវិធី Windows ដើម្បីបើកឯកសារ Python (.py)",
                  "C) ប្រើប្រាស់កម្មវិធី Microsoft Word ដើម្បីសរសេរកូដ ហើយបន្ទាប់មករក្សាទុកជាឯកសារ Python (.py)",
                  "D) បើកកម្មវិធីគេហទំព័រ ដូចជា Google Chrome ហើយបញ្ចូលកូដ Python នៅក្នុងប្រអប់អាសយដ្ឋាន"
                ],
                correct_ans: "A) សរសេរកូដ Python នៅក្នុងកម្មវិធីនិពន្ធកូដ ដូចជា VS Code, Sublime Text ហើយប្រើប្រាស់ថាមពលបញ្ជា Terminal ដើម្បីប្រតិបត្តិការ",
                score: 1
              },
              {
                title: "2. តើpython Indentation ជាអ្វី?",
                answers: [
                  "A) វិធីសាស្រ្តកំណត់ចន្លោះបន្ទាត់សម្រាប់ភាពស្រស់ស្អាតនៃកូដ",
                  "B) ច្បាប់ចាំបាច់ក្នុងភាសា Python ដែលកំណត់រចនាសម្ព័ន្ធនៃប្លុកកូដ",
                  "C) វិធីសាស្រ្តសម្រាប់បន្ថែមយោបល់ក្នុងកូដ Python",
                  "D) វិធីសាស្រ្តសម្រាប់បង្កើនល្បឿននៃការប្រតិបត្តិការកូដ"
                ],
                correct_ans: "B) ច្បាប់ចាំបាច់ក្នុងភាសា Python ដែលកំណត់រចនាសម្ព័ន្ធនៃប្លុកកូដ",
                score: 1
              },
              {
                title: "3. អថេរក្នុង Pythonប្រើដើម្បីអ្វី?",
                answers: [
                  "A) អថេរក្នុង Python អាចចាប់ផ្តើមដោយលេខ",
                  "B) អថេរក្នុង Python អាចប្រើប្រដាប់ខ្ញុំប្រុសក្នុងការកំណត់ឈ្មោះ",
                  "C) អថេរក្នុង Python អាចប្រើប្រាស់ដើម្បីរក្សាទុកទិន្នន័យផ្សេងៗ ដូចជា លេខ  និងតម្លៃBoolean",
                  "D) អថេរក្នុង Python មានភាពប្រែប្រួលនៃអក្សរធំ-អក្សរតូច"
                ],
                correct_ans: "C) អថេរក្នុង Python អាចប្រើប្រាស់ដើម្បីរក្សាទុកទិន្នន័យផ្សេងៗ ដូចជា លេខ ខ្សែអក្សរ និងតម្លៃBoolean",
                score: 1
              }
            ]
          }
        ]
      },
      
      {
        courseId: 'css',
        chapter_title: ' មូលដ្ឋានសំខាន់ៗនៃ CSS',
        lesson_1: {
          title: 'CSS ជាអ្វី',
          time: '10:00',
          discription: 'CSS គឺជាភាសាមួយសម្រាប់ជំនួយដល់ការកែលំអរផ្ទៃខាងមុខនៃ website របស់យើងអោយកាន់តែស្រស់ស្អាត។​ ហើយនៅក្នុងមេរៀននេះវានិងជួយអោយអ្នកទាំងអស់គ្នា បានស្គាល់និងស្វែងយល់ពីវាបានកាន់តែច្រើនដើម្បីជាជំនួយក្នុងការបង្កើត វេបសាយ៍មួយដែលសោភ័ណភាពស្រស់ស្អាតតាមអ្វីដែលយើងចង់បាន។​ហើយយើងក៏មានជាលំហាត់ខ្លះនៅក្នុងមេរៀននេះសម្រាប់តេស្តសមត្ថភាពរបស់អ្នកទាំងអស់គ្នាដើម្បីចង់ដឹងថាបន្ទាប់ពីចប់ថ្នាក់នេះតើអ្នកអាចយល់ពីវាបានប៉ុណ្ណាដែរ។តួនាទីរបស់ CSS ក្នុងការរចនាម៉ោងបណ្ដាការភ្ជាប់ CSS ជាមួយ HTML (Inline, Internal, និង External CSS)',
          vdo_url: 'https://www.youtube.com/embed/qHjthC0n-sU?si=jKQT6SUXt5zBpVzM',
        },
        lesson_2: {
          title: 'ការរចនាstyleមូលដ្ឋាន',
          time: '10:00',
          discription: 'នេះជាមេរៀនបង្រៀនពី CSS ដែលជាភាសាមួយសម្រាប់ជំនួយដល់ការកែលំអរផ្ទៃខាងមុខនៃ វេបសាយ៍ របស់យើងអោយកាន់តែស្រស់ស្អាត។​ ហើយនៅក្នុងមេរៀននេះវានិងជួយអោយអ្នកទាំងអស់គ្នា បានស្គាល់និងស្វែងយល់ពីវាបានកាន់តែច្រើនដើម្បីជាជំនួយក្នុងការបង្កើត វេបសាយ៍មួយដែលសោភ័ណភាពស្រស់ស្អាតតាមអ្វីដែលយើងចង់បាន។​ហើយយើងក៏មានជាលំហាត់ខ្លះនៅក្នុងមេរៀននេះសម្រាប់តេស្តសមត្ថភាពរបស់អ្នកទាំងអស់គ្នាដើម្បីចង់ដឹងថាបន្ទាប់ពីចប់ថ្នាក់នេះតើអ្នកអាចយល់ពីវាបានប៉ុណ្ណាដែរ។',
          vdo_url: 'https://youtube.com/playlist?list=PLuEdNLfGOtnXQgIxwuOjWvhE4pvxJghhk&si=QHnDSVwXYf44fMgs',
        },
        quiz: {
          quiz_title: "quiz 01",
          time_quiz_1: "10:00",
          questionsAnswers: [
            {
              title: "1: មូលដ្ឋានសំខាន់ៗនៃ CSS",
              answers: [
                "a) ភាសាសម្រាប់គូសបញ្ជី",
                "b) ភាសាសម្រាប់ការរចនាម៉ោងបណ្ដាញ",
                "c) ភាសាសម្រាប់សរសេរមូលដ្ឋានទិន្នន័យ",
                "d) ភាសាសម្រាប់សរសេរមូលដ្ឋានទិន្នន័យ",
              ],
              correct_ans: "b) ភាសាសម្រាប់ការរចនាម៉ោងបណ្ដាញ",
              score: 1
            },
            {
              title: "2.តើមានវិធីណាខ្លះក្នុងការភ្ជាប់ CSS ជាមួយ HTML?",
              answers: [
                "a) Inline, Internal, External",
                "b) Inline, External",
                "c) Internal, External",
                "d) Inline, Internal",
              ],
              correct_ans: "a) Inline, Internal, External",
              score: 1
            },
            
          ]
        },
        quiz_2: {
          quiz_title: "quiz 02",
          time_quiz_2: "10:00",
          questionsAnswers: [
            {
              title: "1.តើ Syntax មូលដ្ឋាននៃ CSS មានអ្វីខ្លះ?",
              answers: [
                "a) Tag, ID, និង Class",
                "b) Selectors, Properties, និង Values",
                "c) HTML និង JavaScript",
                "d) CSS និង HTML",
              ],
              correct_ans: "b) Selectors, Properties, និង Values",
              score: 1
            },
            {
              title: "2.តើ CSS Property ណាដែលគេប្រើដើម្បីកំណត់ពណ៌ផ្ទៃខាងក្រោយ?",
              answers: [
                "a) background-color",
                "b) color",
                "c) font-size",
                "d) text-align",
              ],
              correct_ans: "a) background-color",
              score: 1
            },
            {
              title: "3.តើ CSS Property opacity ប្រើសម្រាប់អ្វី?",
              answers: [
                "a) កំណត់ការរំកិលអត្ថបទ",
                "b) កំណត់តម្លៃប្រណិតភាព (Transparency)",
                "c) កំណត់ពណ៌អត្ថបទ",
                "d) a b c d",
              ],
              correct_ans: "b) កំណត់តម្លៃប្រណិតភាព (Transparency)",
              score: 1
            },
            {
              title: "4.តើ font-familyប្រើសម្រាប់អ្វី?",
              answers: [
                "a) កំណត់ពណ៌អត្ថបទ  ",
                "b) កំណត់ប្រភេទអក្សរ",
                "c) កំណត់ទិសអត្ថបទ",
                "d) a b c ",
              ],
              correct_ans: "b",
              score: 1
            }
          ]
        }
      },
      {
        courseId: "html",
        chapter_title: "ជំពូក​ 01: សេចក្តីណែនាំអំពីHTML",
        lesson_1: {
        title: "មេរៀនទី 01: សេចក្តីផ្តើម",
        time: "3:00",
        description: "HTML គឺជាភាសាសម្គាល់ដែលត្រូវបានប្រើប្រាស់ដើម្បីបង្កើតរចនាសម្ព័ន្ធនៃគេហទំព័រ។ វាកំណត់របៀបដែលអត្ថបទ រូបភាព និងធាតុផ្សេងទៀតត្រូវបានបង្ហាញនៅលើទំព័រ។",
        vdo_url: "https://youtu.be/it1rTvBcfRg?si=WxYr9CKMKX6OEOjG"
        },
        quiz: {
          quiz_title: "Quiz 01",
          time_quiz_1: "2:00",
          questionsAnswers: [
            {
              title: "1. តើ HTML Elements ជាអ្វី?",
              answers: [
                "A) ធាតុ HTML គឺជាប្លុកសំណង់មូលដ្ឋាននៃគេហទំព័រ ដែលត្រូវបានបង្កើតឡើងដោយប្រើស្លាក",
                "B) ធាតុ HTML គឺជាពណ៌ផ្ទៃខាងក្រោយនៃគេហទំព័រ",
                "C) ធាតុ HTML គឺជារូបភាពដែលប្រើប្រាស់នៅលើគេហទំព័រ",
                "D) ធាតុ HTML គឺជាភាសា JavaScript ដែលប្រើប្រាស់នៅក្នុងគេហទំព័រ"
              ],
              correct_ans: "A) ធាតុ HTML គឺជាប្លុកសំណង់មូលដ្ឋាននៃគេហទំព័រ ដែលត្រូវបានបង្កើតឡើងដោយប្រើស្លាក",
              score: 1
            },
            {
              title: "2. តើ HTML អាចធ្វើអ្វីបានខ្លះ?",
              answers: [
                "A) បង្កើតកម្មវិធីកុំព្យូទ័រដែលអាចដំណើរការបានដោយឯករាជ្យ",
                "B) បង្កើតរចនាសម្ព័ន្ធ និងបង្ហាញមាតិកានៃគេហទំព័រ ដូចជា អត្ថបទ រូបភាព និងវីដេអូ",
                "C) គ្រប់គ្រងប្រព័ន្ធប្រតិបត្តិការរបស់កុំព្យូទ័រ",
                "D) បង្កើតកម្មវិធីទូរស័ព្ទដៃសម្រាប់ប្រព័ន្ធប្រតិបត្តិការ Android និង iOS"
              ],
              correct_ans: "B) បង្កើតរចនាសម្ព័ន្ធ និងបង្ហាញមាតិកានៃគេហទំព័រ ដូចជា អត្ថបទ រូបភាព និងវីដេអូ",
              score: 1
            },
            {
              title: "3. តើ HTML Tags ជាអ្វី?",
              answers: [
                "A) HTML Tags គឺជាពាក្យបញ្ជាដែលប្រើដើម្បីបង្កើតរចនាសម្ព័ន្ធនៃគេហទំព័រ ដូចជា កំណត់អត្ថបទ រូបភាព និងតារាង។",
                "B) HTML Tags គឺជាភាសាសរសេរកម្មវិធីមួយប្រភេទដែលប្រើដើម្បីបង្កើតកម្មវិធីគេហទំព័រ។",
                "C) HTML Tags គឺជាស្ទីលសម្រាប់ធ្វើឱ្យគេហទំព័រមើលទៅស្អាត និងទាក់ទាញ។",
                "D) HTML Tags គឺជាអក្សរដែលប្រើសរសេរកូដ HTML ទាំងអស់។"
              ],
              correct_ans: "A) HTML Tags គឺជាពាក្យបញ្ជាដែលប្រើដើម្បីបង្កើតរចនាសម្ព័ន្ធនៃគេហទំព័រ ដូចជា កំណត់អត្ថបទ រូបភាព និងតារាង។",
              score: 1
            }
          ]
        }
      },
      
      {
        courseId: 'javascript',
        chapter_title: 'មូលដ្ឋាន JavaScript',
        lesson_1: {
          title: 'JavaScript ជាអ្វី?',
          time: '40:00',
          discription: 'JavaScriptដែលជាភាសាមួយដែលប្រៀបដូចជាសរសៃរឈាមក្នុងការភ្ជាប់ពីទំព័រមួយទៅទំព័រមួយផ្សេងទៀត ឬផ្នែកផ្សេងទៀត​ ដែលជំនួយដល់អ្នកប្រើប្រាស់ងាយស្រួលក្នុងការប្តូរទៅទំព័ផ្សេងទៀត។​ ហើយនៅក្នុងមេរៀននេះវានិងជួយអោយអ្នកទាំងអស់គ្នា បានស្គាល់និងស្វែងយល់ពីវាបានកាន់តែច្រើនដើម្បីជាជំនួយក្នុងការបង្កើត វេបសាយ៍មួយដែលសោភ័ណភាពស្រស់ស្អាតតាមអ្វីដែលយើងចង់បាន។​ហើយយើងក៏មានជាលំហាត់ខ្លះនៅក្នុងមេរៀននេះសម្រាប់តេស្តសមត្ថភាពរបស់អ្នកទាំងអស់គ្នាដើម្បីចង់ដឹងថាបន្ទាប់ពីចប់ថ្នាក់នេះតើអ្នកអាចយល់ពីវាបានប៉ុណ្ណាដែរ។',
          vdo_url: 'https://www.youtube.com/embed/7PJlHDOsiKY?si=8ivSCwC5zR6EUl8P',
        },
        lesson_2: {
          title: 'Function in JavaScript',
          time: '20:00',
          discription: 'JavaScriptដែលជាភាសាមួយដែលប្រៀបដូចជាសរសៃរឈាមក្នុងការភ្ជាប់ពីទំព័រមួយទៅទំព័រមួយផ្សេងទៀត ឬផ្នែកផ្សេងទៀត​ ដែលជំនួយដល់អ្នកប្រើប្រាស់ងាយស្រួលក្នុងការប្តូរទៅទំព័ផ្សេងទៀត។​ ហើយនៅក្នុងមេរៀននេះវានិងជួយអោយអ្នកទាំងអស់គ្នា បានស្គាល់និងស្វែងយល់ពីវាបានកាន់តែច្រើនដើម្បីជាជំនួយក្នុងការបង្កើត វេបសាយ៍មួយដែលសោភ័ណភាពស្រស់ស្អាតតាមអ្វីដែលយើងចង់បាន។​ហើយយើងក៏មានជាលំហាត់ខ្លះនៅក្នុងមេរៀននេះសម្រាប់តេស្តសមត្ថភាពរបស់អ្នកទាំងអស់គ្នាដើម្បីចង់ដឹងថាបន្ទាប់ពីចប់ថ្នាក់នេះតើអ្នកអាចយល់ពីវាបានប៉ុណ្ណាដែរ។',
          vdo_url: 'https://www.youtube.com/embed/7PJlHDOsiKY?si=8ivSCwC5zR6EUl8P',
        },
        quiz: {
          quiz_title: "Quiz 01",
          time_quiz_1: "2:00",
          questionsAnswers: [
            {
              title: "1.តើ JavaScript គឺជាអ្វី?",
              answers: [
                "A) ភាសាសរសេរកម្មវិធីដែលប្រើប្រាស់សម្រាប់បង្កើតគេហទំព័រជាចម្បង",
                "B) ភាសាសម្រាប់រចនាស្ទីល",
                "c) ភាសាសម្រាប់គ្រប់គ្រងមូលដ្ឋានទិន្នន័យ",
              ],
              correct_ans: "B) ភាសាសម្រាប់រចនាស្ទីល",
              score: 1
            },
            {
              title: "2.តើវិធីណាដែល JavaScript អាចភ្ជាប់ជាមួយ HTML?",
              answers: [
                "a) Inline JavaScript",
                "b) External JavaScript ",
                "c) Internal JavaScript",
                "d) a b c",
              ],
              correct_ans: "d) a b c",
              score: 1
            },
            {
              title: "3.តើគេប្រើ const សម្រាប់",
              answers: [
                "a) ការបង្កើត Variable ដែលអាចផ្លាស់ប្តូរ",
                "b) ការបង្កើត Variable ដែលមិនអាចផ្លាស់ប្តូរតម្លៃ",
                "c) ការប្រើ Variable សម្រាប់ String",
                "d) ការប្រើ Variable សម្រាប់ Number",
              ],
              correct_ans: "b) ការបង្កើត Variable ដែលមិនអាចផ្លាស់ប្តូរតម្លៃ",
              score: 1
            },
            {
              title: "4.តើគេប្រើ let សម្រាប់",
              answers: [
                "a) ការបង្កើត Variable ដែលអាចផ្លាស់ប្តូរ",
                "b) ការបង្កើត Variable ដែលមិនអាចផ្លាស់ប្តូរតម្លៃ",
                "c) ការប្រើ Variable សម្រាប់ String",
                "d) ការប្រើ Variable សម្រាប់ Number",
              ],
              correct_ans: "a) ការបង្កើត Variable ដែលអាចផ្លាស់ប្តូរ",
              score: 1
            }
          ]
        },
        quiz_2: {
          quiz_title: "Quiz 02",
          time_quiz_2: "3:00",
          questionsAnswers: [
            {
              title: "1.តើ Operator "===" មានន័យថា:",
              answers: [
                "a) ប្រៀបធៀបទំហំតែប៉ុណ្ណោះ",
                "b) ប្រៀបធៀបតម្លៃ និង Data Type",
                "c) ប្រៀបធៀបតម្លៃ និងតម្លៃ",
                "d) ប្រៀបធៀបតម្លៃ និងតម្លៃ និង Data Type",
              ],
              correct_ans: "b) ប្រៀបធៀបតម្លៃ និង Data Type",
              score: 1
            },
            {
              title: "2.តើ JavaScript Function ត្រូវបានប្រើសម្រាប់អ្វី?",
              answers: [
                "a) ការកំណត់តម្លៃ Variables",
                "b) ការបង្កើតសកម្មភាពដែលអាចប្រើបានច្រើនដង",
                "c) ការបញ្ចូល HTML Document",
                "d) ការប្រើប្រាស់សម្រាប់ក្នុងការប្តូរទំព័រជាចម្បង",
              ],
              correct_ans: "b) ការបង្កើតសកម្មភាពដែលអាចប្រើបានច្រើនដង",
              score: 1
            },
            {
              title: "3.តើ Event Listener onclick ធ្វើអ្វី?",
              answers: [
                "a) ប្រើសម្រាប់ការកំណត់ពណ៌",
                "b) សកម្មភាពកើតឡើងនៅពេលចុចលើ HTML Element",
                "c) ការចាប់ឃើញទិសដៅអត្ថបទ",
             
              ],
              correct_ans: "b) សកម្មភាពកើតឡើងនៅពេលចុចលើ HTML Element",
              score: 1
            },
          ]
        }
      },
      {
        courseId: 'java',
        chapter_title: 'ជំពូក​ 01: សេចក្តីណែនាំអំពី JAVA',
        lesson_1: {
          title: 'មេរៀនទី 01: សេចក្តីផ្តើម JAVA',
          time: '3:00',
          description: 'Java គឺជាភាសាសរសេរកម្មវិធី និងវេទិកាកុំព្យូទ័រដែលប្រើដើម្បីបង្កើតកម្មវិធីសម្រាប់ឧបករណ៍ជាច្រើន។ វាគឺជាជម្រើសដ៏ពេញនិយមសម្រាប់អ្នកអភិវឌ្ឍន៍ ព្រោះវាលឿន ជឿជាក់ និងសុវត្ថិភាព។',
          vdo_url: 'https://youtu.be/t54pgbVy6t0?si=DUr9ZDYxU040u1Gw'
        },
        lesson_2: {
          title: 'មេរៀនទី 02: ការបង្កើត Variable in JAVA',
          time: '2:00',
          description: 'HTML គឺជាភាសាសម្គាល់ដែលត្រូវបានប្រើប្រាស់ដើម្បីបង្កើតរចនាសម្ព័ន្ធនៃគេហទំព័រ។ វាកំណត់របៀបដែលអត្ថបទ រូបភាព និងធាតុផ្សេងទៀតត្រូវបានបង្ហាញនៅលើទំព័រ។',
          vdo_url: 'https://youtu.be/YF59k3gZeb4?si=33omL9QhfS-gFtx_'
        },
        quiz: {
          quiz_title: 'Quiz 01',
          time_quiz_1: '2:00',
          questionsAnswers: [
            {
              title: '1. តើ JAVA ជាអ្វី?',
              answers: [
                'A) ភាសាសរសេរកម្មវិធីដែលប្រើប្រាស់សម្រាប់បង្កើតគេហទំព័រជាចម្បង',
                'B) ភាសាសរសេរកម្មវិធីដែលអាចប្រើប្រាស់បានលើប្រព័ន្ធប្រតិបត្តិការផ្សេងៗ និងប្រើប្រាស់បានទូលំទូលាយក្នុងការអភិវឌ្ឍន៍កម្មវិធី កម្មវិធីទូរស័ព្ទ និងប្រព័ន្ធស្មុគស្មាញ',
                'C) ភាសាសរសេរកម្មវិធីដែលប្រើប្រាស់សម្រាប់បង្កើតកម្មវិធីទូរស័ព្ទដៃតែប៉ុណ្ណោះ',
                'D) ភាសាសរសេរកម្មវិធីសម្រាប់បង្កើតហ្គេមកុំព្យូទ័រជាចម្បង'
              ],
              correct_ans: 'B) ភាសាសរសេរកម្មវិធីដែលអាចប្រើប្រាស់បានលើប្រព័ន្ធប្រតិបត្តិការផ្សេងៗ និងប្រើប្រាស់បានទូលំទូលាយក្នុងការអភិវឌ្ឍន៍កម្មវិធី កម្មវិធីទូរស័ព្ទ និងប្រព័ន្ធស្មុគស្មាញ',
              score: 1
            },
            {
              title: '2. តើ JAVA អាចធ្វើអ្វីបានខ្លះ?',
              answers: [
                'A) បង្កើតកម្មវិធីសម្រាប់ប្រព័ន្ធប្រតិបត្តិការ Windows តែប៉ុណ្ណោះ',
                'B) បង្កើតកម្មវិធីសម្រាប់ឧបករណ៍ចល័ត កម្មវិធីគេហទំព័រ កម្មវិធីសហគ្រាស និងច្រើនទៀត',
                'C) ប្រើប្រាស់សម្រាប់បង្កើតឯកសារ Microsoft Word និង Excel តែប៉ុណ្ណោះ',
                'D) ប្រើប្រាស់សម្រាប់លេងហ្គេមកុំព្យូទ័រតែប៉ុណ្ណោះ'
              ],
              correct_ans: 'B) បង្កើតកម្មវិធីសម្រាប់ឧបករណ៍ចល័ត កម្មវិធីគេហទំព័រ កម្មវិធីសហគ្រាស និងច្រើនទៀត',
              score: 1
            },
            {
              title: '3. ហេតុអ្វីបានជាយើងរៀន Java?',
              answers: [
                'A) Java ជាភាសាសរសេរកម្មវិធីដែលមានប្រជាប្រិយភាពខ្ពស់ និងត្រូវបានប្រើប្រាស់យ៉ាងទូលំទូលាយក្នុងឧស្សាហកម្មអ៊ីនធឺណេត និងកម្មវិធីទូរស័ព្ទ Android',
                'B) Java ជាភាសាសរសេរកម្មវិធីដែលងាយស្រួលរៀន និងមានសហគមន៍អ្នកប្រើប្រាស់ធំ',
                'C) ការរៀន Java អាចជួយអ្នកឱ្យយល់ពីគោលការណ៍សំខាន់ៗនៃការសរសេរកម្មវិធី ដូចជា ការរចនាវត្ថុប័ត្រ និងការគ្រប់គ្រងទិន្នន័យ',
                'D) ការស្គាល់ Java អាចបើកទ្វារឱកាសការងារជាច្រើន និងប្រាក់ខែខ្ពស់ក្នុងវិស័យបច្ចេកវិទ្យា'
              ],
              correct_ans: 'ចម្លើយត្រឹមត្រូវ: ទាំងអស់',
              score: 1
            }
          ]
        }
      },
      {
        courseId: 'bootstrap',
        chapter_title: 'ជំពូក​ 01: សេចក្តីណែនាំអំពី Bootstrap',
        lesson_1: {
          title: 'មេរៀនទី 01: Bootstrap ជាអ្វី?',
          time: '3:00',
          description: 'នេះជាមេរៀនបង្រៀនពី Boostrap ដែលជា framework របស់ Css វានិងធ្វើអោយយើងងាយស្រួលក្នុងការហៅវាមកប្រើប្រាស់ដោយមិនវាមិនធ្វើអោយយើងប្រើ CSS ច្រើន។​ ហើយនៅក្នុងមេរៀននេះវានិងជួយអោយអ្នកទាំងអស់គ្នា បានស្គាល់និងស្វែងយល់ពីវាបានកាន់តែច្រើនដើម្បីជាជំនួយក្នុងការបង្កើត វេបសាយ៍មួយដែលសោភ័ណភាពស្រស់ស្អាតតាមអ្វីដែលយើងចង់បាន។​ហើយយើងក៏មានជាលំហាត់ខ្លះនៅក្នុងមេរៀននេះសម្រាប់តេស្តសមត្ថភាពរបស់អ្នកទាំងអស់គ្នាដើម្បីចង់ដឹងថាបន្ទាប់ពីចប់ថ្នាក់នេះតើអ្នកអាចយល់ពីវាបានប៉ុណ្ណាដែរ។',
          vdo_url: 'https://youtube.com/playlist?list=PLb7Jk4WtxwmpRKah2EZP1RPr8NG_u_d9i&si=gvnaNdZ2sPaIWmx_'
        },
        lesson_2: {
          title: 'មេរៀនទី 02: តើ Bootstrap ជាអ្វី?',
          time: '2:00',
          description: 'យល់ដឹងអំពី 12-column grid system  Classes: .container, .row, និង .col របៀបបែងចែក Layout ដោយប្រើ Columns និង Rows ',
          vdo_url: 'https://youtu.be/YF59k3gZeb4?si=33omL9QhfS-gFtx_'
        },
        quiz: {
          quiz_title: 'Quiz 01',
          time_quiz_1: '2:00',
          questionsAnswers: [
            {
              title: '1. តើ Bootstrap ជាអ្វី? ',
              answers: [
                'A) Framework សម្រាប់ JavaScript',
                'B) Framework សម្រាប់ការរចនាម៉ោងបណ្ដាញ',
                'C) Database Management Tool',
              ],
              correct_ans: 'B) Framework សម្រាប់ការរចនាម៉ោងបណ្ដាញ',
              score: 1
            },
            {
              title: '2. តើអត្ថប្រយោជន៍ចម្បងនៃ Bootstrap គឺជាអ្វី?',
              answers: [
                'A) ជួយបង្កើត UI ដែលមានការឆ្លើយតបទៅកាន់ទំហំអេក្រង់',
                'B) ការគ្រប់គ្រងទិន្នន័យ',
                'C) ការបង្កើតស្ទីលដោយគ្មាន Classes',
              ],
              correct_ans: 'A) ជួយបង្កើត UI ដែលមានការឆ្លើយតបទៅកាន់ទំហំអេក្រង់',
              score: 1
            },
            {
              title: '3. តើ Bootstrap Grid System ត្រូវបានបែងចែកជាប៉ុន្មាន Columns?',
              answers: [
                'A) 6 Columns',
                'B) 12 Columns',
                'C) 24 Columns',
              ],
              correct_ans: 'B) 12 Columns',
              score: 1
            },
            {
              title: '4. តើអ្វីគឺជារបស់ Bootstrap?',
              answers: [
                'A) CSS Framework',
                'B) JavaScript Framework',
                'C) PHP Framework',
              ],
              correct_ans: 'A) CSS Framework',
              score: 1
            }
            
          ]
        }
      },
      {
        courseId: 'tailwind',
        chapter_title: 'ជំពូក​ 01: មូលដ្ឋាន Tailwind CSS',
        lesson_1: {
          title: 'មេរៀនទី 01: Tailwind CSS ជាអ្វី?',
          time: '3:00',
          description: 'នេះជាមេរៀនបង្រៀនពី Tailwind Css ដែលជា framework របស់ Css វានិងធ្វើអោយយើងងាយស្រួលក្នុងការហៅវាមកប្រើប្រាស់ដោយមិនវាមិនធ្វើអោយយើងប្រើ CSS ច្រើន។​ ហើយនៅក្នុងមេរៀននេះវានិងជួយអោយអ្នកទាំងអស់គ្នា បានស្គាល់និងស្វែងយល់ពីវាបានកាន់តែច្រើនដើម្បីជាជំនួយក្នុងការបង្កើត វេបសាយ៍មួយដែលសោភ័ណភាពស្រស់ស្អាតតាមអ្វីដែលយើងចង់បាន។​ហើយយើងក៏មានជាលំហាត់ខ្លះនៅក្នុងមេរៀននេះសម្រាប់តេស្តសមត្ថភាពរបស់អ្នកទាំងអស់គ្នាដើម្បីចង់ដឹងថាបន្ទាប់ពីចប់ថ្នាក់នេះតើអ្នកអាចយល់ពីវាបានប៉ុណ្ណាដែរ។',
          vdo_url: 'https://youtube.com/playlist?list=PLb7Jk4WtxwmqNIl6xXOUQ5Qj6g0JBBgP6&si=czLc_c6Xbhy51sPE'
        },
        lesson_2: {
          title: 'មេរៀនទី 02: Tawind Syntax និង Classesil',
          time: '2:00',
          description: 'Utility Classes គឺជាអ្វី? របៀបប្រើ Utility Classes ដើម្បីកំណត់ស្ទីល (Spacing, Colors, Flexbox)  ឧទាហរណ៍នៃការរចនាដោយប្រើ Tailwind Classes',
          vdo_url: 'https://youtu.be/YF59k3gZeb4?si=33omL9QhfS-gFtx_'
        },
        quiz: {
          quiz_title: 'Quiz 01',
          time_quiz_1: '2:00',
          questionsAnswers: [
            {
              title: '1. តើ Tailwind CSS ជាអ្វី ',
              answers: [
                'A) CSS Framework ប្រភេទ Utility-firstt',
                'B) JavaScript Framewor',
                'C) Database Management Tool',
              ],
              correct_ans: 'A) CSS Framework ប្រភេទ Utility-firstt',
              score: 1
            },
            {
              title: '2. តើអត្ថប្រយោជន៍ចម្បងនៃ Tailwind CSS គឺជាអ្វី?',
              answers: [
                'A) ផ្តល់ជាគំរូដ៏ធំទូលាយ',
                'B) ការប្រើ Utility Classes ដើម្បីរចនាស្ទីល UI បានរហ័ស',
                'C) ការរចនាម៉ោងបណ្ដាញដោយគ្មាន Classes',
              ],
              correct_ans: 'B) ការប្រើ Utility Classes ដើម្បីរចនាស្ទីល UI បានរហ័ស',
              score: 1
            },
            {
              title: '3. តើ Tailwind Utility Class "p-4" មានន័យថា:',
              answers: [
                'A) Padding 16px',
                'B) Padding 4p',
                'C) Padding 8px',
              ],
              correct_ans: 'A) Padding 16px',
              score: 1
            },
            {
              title: '4. តើ Tailwind Class "bg-blue-500" ប្រើសម្រាប់:',
              answers: [
                'A) កំណត់ Background Color ជា Blue',
                'B) កំណត់ Border Color ជា Blue',
                'C) កំណត់ Text Color ជា Blue',
              ],
              correct_ans: 'A) កំណត់ Background Color ជា Blue',
              score: 1
            }
            
          ]
        }
      },
      






    
    


    ]
  }),
  getters: {
    getCoursesDetails: (state) => state.coursesDetails,
    getFeatures: (state) => state.features,
    getCourseDetailsChapter: (state) => state.courseDetailsChapter,
  },
  actions: {


  },
});
