<template>
    <div class=" w-full bg-white h-[32rem]">
      <!-- Page Title -->
      <h1 class="text-5xl text-center mt-[30px] hover:text-green-600 indent-[-80px] ">អំពីពួកយើង</h1>
  
      <!-- Welcome Section -->
      <section class="  flex " >
        <div class="mt-[30px] w-[70%] hover:text-blue-500 space-50  text-center ">
          <p class="leading-[2rem] text-xl">
            សូមស្វាគមន៍មកកាន់គេហទំព័រ ZCode.cam! 
            បេសកកម្មរបស់យើងគឺធ្វើឱ្យការសរសេរកូដមានលក្ខណៈសាមញ្ញ 
            ដែលមនុស្សគ្រប់គ្នាអាចចូលទៅរៀនបានដោយសេរីនិងមិនគិតថ្លៃសម្រាប់មនុស្សគ្រប់គ្នា។ 
            នៅ ZCode.cam យើងផ្តល់ជូននូវវគ្គសិក្សាជាភាសាសរសេរកម្មវិធីសំខាន់ៗ រួមមាន HTML, CSS, JavaScript, C++, C, Python, Java និង PHP។ 
            វគ្គសិក្សានីមួយៗត្រូវបានរចនាឡើងដើម្បីជួយអ្នកបង្កើតមូលដ្ឋានគ្រឹះដ៏រឹងមាំ និងបង្កើតគម្រោងដែលបង្ហាញពីសមត្ថភាពរបស់អ្នក។
          </p>
        </div>
        <div class=" w-[40%] transition-opacity duration-300   hover:w-[600px]">
          <img src="../assets/aboutUs.png" alt="ZCode Team" />
        </div>
      </section>
    </div>
</template>
  
  <style scoped>
  .about-us-content {
    font-family: "Battambang", sans-serif;
    text-align: center;
    padding: 20px;
  }
  

  </style>
  